CSI API ETABS v1
cDatabaseTables.GetAllFieldsInTable Method
 Returns the available fields in a specified table.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAllFieldsInTable(
	string TableKey,
	ref int TableVersion,
	ref int NumberFields,
	ref string[] FieldKey,
	ref string[] FieldName,
	ref string[] Description,
	ref string[] UnitsString,
	ref bool[] IsImportable
)
Function GetAllFieldsInTable (
	TableKey As String,
	ByRef TableVersion As Integer,
	ByRef NumberFields As Integer,
	ByRef FieldKey As String(),
	ByRef FieldName As String(),
	ByRef Description As String(),
	ByRef UnitsString As String(),
	ByRef IsImportable As Boolean()
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim TableVersion As Integer
Dim NumberFields As Integer
Dim FieldKey As String()
Dim FieldName As String()
Dim Description As String()
Dim UnitsString As String()
Dim IsImportable As Boolean()
Dim returnValue As Integer
returnValue = instance.GetAllFieldsInTable(TableKey,
	TableVersion, NumberFields, FieldKey,
	FieldName, Description, UnitsString,
	IsImportable)
int GetAllFieldsInTable(
	String^ TableKey,
	int% TableVersion,
	int% NumberFields,
	array<String^>^% FieldKey,
	array<String^>^% FieldName,
	array<String^>^% Description,
	array<String^>^% UnitsString,
	array<bool>^% IsImportable
)
abstract GetAllFieldsInTable :
        TableKey : string *
        TableVersion : int byref *
        NumberFields : int byref *
        FieldKey : string[] byref *
        FieldName : string[] byref *
        Description : string[] byref *
        UnitsString : string[] byref *
        IsImportable : bool[] byref -> int
Parameters
TableKey
Type: System.String
Input Item: The table key for the table for which the fields will be returned.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
NumberFields
Type: System.Int32
Returned Item: The number of available fields in the specified table.
FieldKey
Type: System.String[]
Returned Item: A zero-based array of the field keys for the specified table.
FieldName
Type: System.String[]
Returned Item: A zero-based array of the field names for the specified table.
Description
Type: System.String[]
Returned Item: A zero-based array of the field descriptions for the specified table.
UnitsString
Type: System.String[]
Returned Item: A zero-based array of the field units for the specified table.
IsImportable
Type: System.Boolean[]
Returned Item: A zero-based array of whether the field is importable for the specified table.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace